In [1]:
''' pandas Series and DataFrame '''

' pandas Series and DataFrame '

In [2]:
import pandas as pd

In [3]:
obj = pd.Series([4,5,6,-7])

In [4]:
print(obj)

0    4
1    5
2    6
3   -7
dtype: int64

In [5]:
obj[4]=10

In [6]:
len(obj)

5

In [7]:
print(obj.index)

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [8]:
print(obj.values)

[ 4  5  6 -7 10]

In [9]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'c', 'a'])

In [10]:
print(obj2)

d    4
b    7
c   -5
a    3
dtype: int64

In [11]:
obj2['c'] = 6

In [12]:
print(obj2)

d    4
b    7
c    6
a    3
dtype: int64

In [13]:
sdata = {
    'beijing': 35000,
    'shanghai': 71000,
    'guangzhou': 16000,
    'shenzhen': 5000
}

obj3 = pd.Series(sdata)
print(obj3)

beijing      35000
shanghai     71000
guangzhou    16000
shenzhen      5000
dtype: int64

In [14]:
#----------------------DataFrame---------------------

In [15]:
data = {'city': ['shanghai', 'shanghai', 'shanghai', 'beijing', 'beijing'],
        'year': [2016, 2017, 2018, 2017, 2018],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = pd.DataFrame(data)

In [16]:
print(data)

{'city': ['shanghai', 'shanghai', 'shanghai', 'beijing', 'beijing'], 'year': [2016, 2017, 2018, 2017, 2018], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [17]:
frame

       city  year  pop
0  shanghai  2016  1.5
1  shanghai  2017  1.7
2  shanghai  2018  3.6
3   beijing  2017  2.4
4   beijing  2018  2.9

In [18]:
frame2 = pd.DataFrame(data, columns=['year', 'city', 'pop'])

In [19]:
frame2

   year      city  pop
0  2016  shanghai  1.5
1  2017  shanghai  1.7
2  2018  shanghai  3.6
3  2017   beijing  2.4
4  2018   beijing  2.9

In [20]:
frame['year']

0    2016
1    2017
2    2018
3    2017
4    2018
Name: year, dtype: int64

In [21]:
frame.loc[1:2]

       city  year  pop
1  shanghai  2017  1.7
2  shanghai  2018  3.6

In [22]:
frame.loc[[1]]

       city  year  pop
1  shanghai  2017  1.7

In [23]:
frame.loc[1:1]

       city  year  pop
1  shanghai  2017  1.7

In [25]:
!ls

Day2.ipynb                    readme.txt
Day2_Example.ipynb            writeme.txt
Day3.ipynb                    学习成绩.xlsx
Day4.ipynb                    年龄对照表.csv
day01.py                      年龄对照表.xlsx
helloWorld.ipynb              修改后的学习成绩.xlsx
mymode.py

In [26]:
# 
student_data = pd.read_excel('学习成绩.xlsx')

In [30]:
student_data

    学号   姓名 性别  英语  体育  军训  数学    语文
0    0   陈龙  男  76  79  77  40  63.0
1    1   周怡  女  81  87  64  75  82.0
2    2   张波  男  62  91  92  76  61.0
3    3   李华  女  93  88  75  79  81.0
4    4   于浩  男  91  89  89  92  77.0
5    5   赵宇  男  作弊  86  72  47  53.0
6    6   王慧  女  82  87  92  91  88.0
7    7  李晓亮  男  81  92  93  85   NaN
8    6   王慧  女  82  87  92  91  88.0
9    9   郭昊  男  91  92  76  88  57.0
10   0   陈龙  男  76  79  77  40  63.0

In [31]:
student_data.describe()

              学号         体育         军训         数学        语文
count  11.000000  11.000000  11.000000  11.000000  10.00000
mean    3.909091  87.000000  81.727273  73.090909  71.30000
std     2.981763   4.472136  10.139930  20.690358  13.25854
min     0.000000  79.000000  64.000000  40.000000  53.00000
25%     1.500000  86.500000  75.500000  61.000000  61.50000
50%     4.000000  87.000000  77.000000  79.000000  70.00000
75%     6.000000  90.000000  92.000000  89.500000  81.75000
max     9.000000  92.000000  93.000000  92.000000  88.00000

In [32]:
student_data.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10     True
dtype: bool

In [33]:
student_data['学号'].duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10     True
Name: 学号, dtype: bool

In [34]:
student_data1 = student_data.drop_duplicates()

In [35]:
student_data1

   学号   姓名 性别  英语  体育  军训  数学    语文
0   0   陈龙  男  76  79  77  40  63.0
1   1   周怡  女  81  87  64  75  82.0
2   2   张波  男  62  91  92  76  61.0
3   3   李华  女  93  88  75  79  81.0
4   4   于浩  男  91  89  89  92  77.0
5   5   赵宇  男  作弊  86  72  47  53.0
6   6   王慧  女  82  87  92  91  88.0
7   7  李晓亮  男  81  92  93  85   NaN
9   9   郭昊  男  91  92  76  88  57.0

In [36]:
student_data2=student_data1.replace(['作弊'],0)

In [37]:
student_data2

   学号   姓名 性别  英语  体育  军训  数学    语文
0   0   陈龙  男  76  79  77  40  63.0
1   1   周怡  女  81  87  64  75  82.0
2   2   张波  男  62  91  92  76  61.0
3   3   李华  女  93  88  75  79  81.0
4   4   于浩  男  91  89  89  92  77.0
5   5   赵宇  男   0  86  72  47  53.0
6   6   王慧  女  82  87  92  91  88.0
7   7  李晓亮  男  81  92  93  85   NaN
9   9   郭昊  男  91  92  76  88  57.0

In [38]:
student_data3 = student_data2.fillna(student_data2['语文'].mean())

In [39]:
student_data3

   学号   姓名 性别  英语  体育  军训  数学     语文
0   0   陈龙  男  76  79  77  40  63.00
1   1   周怡  女  81  87  64  75  82.00
2   2   张波  男  62  91  92  76  61.00
3   3   李华  女  93  88  75  79  81.00
4   4   于浩  男  91  89  89  92  77.00
5   5   赵宇  男   0  86  72  47  53.00
6   6   王慧  女  82  87  92  91  88.00
7   7  李晓亮  男  81  92  93  85  70.25
9   9   郭昊  男  91  92  76  88  57.00

In [40]:
student_data3['GPA'] = (student_data3['英语'] + student_data3['体育'] + student_data3['军训'] + \
        student_data3['数学'] + student_data3['语文'])/5

In [41]:
student_data3

   学号   姓名 性别  英语  体育  军训  数学     语文    GPA
0   0   陈龙  男  76  79  77  40  63.00  67.00
1   1   周怡  女  81  87  64  75  82.00  77.80
2   2   张波  男  62  91  92  76  61.00  76.40
3   3   李华  女  93  88  75  79  81.00  83.20
4   4   于浩  男  91  89  89  92  77.00  87.60
5   5   赵宇  男   0  86  72  47  53.00  51.60
6   6   王慧  女  82  87  92  91  88.00  88.00
7   7  李晓亮  男  81  92  93  85  70.25  84.25
9   9   郭昊  男  91  92  76  88  57.00  80.80

In [42]:
student_data3.groupby(['性别','语文'])['GPA'].mean()

性别  语文
女   81.00    83.20
    82.00    77.80
    88.00    88.00
男   53.00    51.60
    57.00    80.80
    61.00    76.40
    63.00    67.00
    70.25    84.25
    77.00    87.60
Name: GPA, dtype: float64

In [43]:
student_data3.sort_values(by=['GPA'], ascending=False)

   学号   姓名 性别  英语  体育  军训  数学     语文    GPA
6   6   王慧  女  82  87  92  91  88.00  88.00
4   4   于浩  男  91  89  89  92  77.00  87.60
7   7  李晓亮  男  81  92  93  85  70.25  84.25
3   3   李华  女  93  88  75  79  81.00  83.20
9   9   郭昊  男  91  92  76  88  57.00  80.80
1   1   周怡  女  81  87  64  75  82.00  77.80
2   2   张波  男  62  91  92  76  61.00  76.40
0   0   陈龙  男  76  79  77  40  63.00  67.00
5   5   赵宇  男   0  86  72  47  53.00  51.60

In [ ]:
bins = [0,60,70,80,90,100]
labels = ['不合格','差','中等','良好','优秀']
student_data3['类别'] = pd.cut(student_data3['GPA'], bins, labels=labels)

In [ ]:
student_data3

In [ ]:
pd.write_excel(student_data3, '修改后的学习成绩')